In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('./data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [5]:
df2 = pd.read_csv('./data/data', sep='|')
df2

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [12]:
columnas = ['nombre', 'edad', 'ciudad']

df3= pd.read_csv('./data/data_without_header', sep=',', header=None, names=columnas)
df3

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [14]:
df4=pd.read_json('./data/data.json')
df4

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [15]:
df.head()

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [16]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [22]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [24]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [27]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [28]:
df['edad']

0    25
1    30
2    35
Name: edad, dtype: int64

In [31]:
df[['nombre','edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [32]:
df.loc[0]

nombre      Juan
edad          25
ciudad    Madrid
Name: 0, dtype: object

In [39]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [40]:
df[df['edad']>25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [43]:
def multiplicador(edad):
    doble_edad = edad * 2
    return doble_edad

In [44]:
df['doble_edad'] = df['edad'] * 2
df

  nombre  edad     ciudad  doble_edad
0   Juan    25     Madrid          50
1  María    30  Barcelona          60
2  Pedro    35    Sevilla          70

In [45]:
df['doble_edad_func']=df['edad'].apply(multiplicador)
df

  nombre  edad     ciudad  doble_edad  doble_edad_func
0   Juan    25     Madrid          50               50
1  María    30  Barcelona          60               60
2  Pedro    35    Sevilla          70               70

In [46]:
df5 = pd.DataFrame(
    [
       (1, 345, 'B', True),
       (2, 100, 'C', False),
       (3, 300, 'B', False),
       (4, 151, 'A', False),
       (5, 212, 'A', True),
       (6, 121, 'C', False),
       (7, 333, 'B', True),
       (8, 456, 'C', True),
    ],
    columns=['id', 'value', 'colC', 'colD'])
df6 = pd.DataFrame(
    [
       (1, 111, 10.1, 3),
       (9, 56, 3.33, 10),
       (10, 17, 18.0, 8),
       (3, 567, 19.1, 4),
       (11, 98, 2.1, 1),
       (6, 31, 3.14, 12),
    ],
    columns=['id', 'value', 'colE', 'colF'])

In [49]:
df5

   id  value colC   colD
0   1    345    B   True
1   2    100    C  False
2   3    300    B  False
3   4    151    A  False
4   5    212    A   True
5   6    121    C  False
6   7    333    B   True
7   8    456    C   True

In [50]:
df6

   id  value   colE  colF
0   1    111  10.10     3
1   9     56   3.33    10
2  10     17  18.00     8
3   3    567  19.10     4
4  11     98   2.10     1
5   6     31   3.14    12

In [51]:
#Inner Join
df5.merge(df6, on='id')

   id  value_x colC   colD  value_y   colE  colF
0   1      345    B   True      111  10.10     3
1   3      300    B  False      567  19.10     4
2   6      121    C  False       31   3.14    12

In [55]:
#Left Join
df5.merge(df6, on='id', how='left')

   id  value_x colC   colD  value_y   colE  colF
0   1      345    B   True    111.0  10.10   3.0
1   2      100    C  False      NaN    NaN   NaN
2   3      300    B  False    567.0  19.10   4.0
3   4      151    A  False      NaN    NaN   NaN
4   5      212    A   True      NaN    NaN   NaN
5   6      121    C  False     31.0   3.14  12.0
6   7      333    B   True      NaN    NaN   NaN
7   8      456    C   True      NaN    NaN   NaN

In [2]:
#Right Join
df5.merge(df6, on='id', how='right')

NameError: name 'df5' is not defined

In [1]:
#EN CASO DE TENER COLUMNAS CON DIFERENTES NOMBRES
df5.merge(df6, left_on='id', right_on='id2')

NameError: name 'df5' is not defined